title: Certreq Remote Retrieval
id: 42734f06-a279-41e3-b23a-4143cc478e20
description: Detects suspicious certreq remote retrieval behavior often associated
  with LOLBin abuse.
status: stable
author: Jean Koumou
date: '2026-03-21'
references:
- https://lolbas-project.github.io/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \certreq.exe
    CommandLine|contains:
    - -post
    - http://
    - https://
  condition: selection
falsepositives:
- Rare administrative troubleshooting
tags:
- attack.defense_evasion
- attack.t1105
level: high
