title: Generic Encoded Interpreter Invocation
id: d70cfbdc-bf3e-49dd-af3c-d9db36edc7dc
description: Broad heuristic rule for generic encoded interpreter invocation included
  to generate governance findings.
status: test
author: RuleScope Demo
date: '2026-03-21'
references:
- https://example.org/demo
logsource:
  product: windows
  category: process_creation
detection:
  sel1:
    CommandLine|contains:
    - -enc
    - base64
    - frombase64string
    Image|contains:
    - '*powershell*'
    - '*cscript*'
    - '*wscript*'
  sel2:
    ParentImage|contains:
    - '*cmd*'
    - '*powershell*'
  condition: sel1 or sel2
falsepositives: []
tags:
- attack.execution
- attack.discovery
level: high
