title: MSHTA Remote Payload Execution
id: 55b59f23-da45-48cf-acaa-5477a6468fbd
description: Detects suspicious mshta remote payload execution behavior often associated
  with LOLBin abuse.
status: stable
author: Jean Koumou
date: '2026-03-21'
references:
- https://lolbas-project.github.io/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \mshta.exe
    CommandLine|contains:
    - http://
    - https://
    - .hta
  condition: selection
falsepositives:
- Rare administrative troubleshooting
tags:
- attack.defense_evasion
- attack.t1218.005
level: high
