title: Net Group Domain Admins Enumeration
id: 1cf044f1-58f1-4dcc-b9eb-af2016d69946
description: Detects net group domain admins enumeration often linked to adversary
  discovery or impact activity.
status: stable
author: Jean Koumou
date: '2026-03-21'
modified: '2026-03-21'
references:
- https://attack.mitre.org/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - net group
    - '"Domain Admins"'
    - /domain
  condition: selection
falsepositives:
- Rare but legitimate admin maintenance
tags:
- attack.discovery
- attack.t1069.002
level: medium
