title: NLTest Domain Trust Enumeration
id: bc112255-4379-4dee-8c0f-620587b948b7
description: Detects nltest domain trust enumeration often linked to adversary discovery
  or impact activity.
status: stable
author: Jean Koumou
date: '2026-03-21'
modified: '2026-03-21'
references:
- https://attack.mitre.org/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - nltest
    - /domain_trusts
    - /all_trusts
  condition: selection
falsepositives:
- Rare but legitimate admin maintenance
tags:
- attack.discovery
- attack.t1482
level: medium
