title: PowerShell Hidden NoProfile
id: 5ad045ba-0a22-4803-8f34-8f4f69d77860
description: Detects powershell hidden noprofile patterns in process creation telemetry
  for governance demonstration.
status: experimental
author: Jean Koumou
date: '2026-03-21'
modified: '2026-03-21'
references:
- https://attack.mitre.org/
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
    Image|endswith: \powershell.exe
  selection_cmd:
    CommandLine|contains:
    - -nop
    - -w hidden
    - -noni
  condition: selection_img and selection_cmd
falsepositives:
- Administrative PowerShell automation
- Blue-team triage activity
tags:
- attack.execution
- attack.t1059.001
level: medium
