title: PowerShell Long Base64 Blob
id: fdd50b14-11d5-4607-ab21-865c3efd4408
description: Detects powershell long base64 blob patterns in process creation telemetry
  for governance demonstration.
status: experimental
author: Jean Koumou
date: '2026-03-21'
modified: '2026-03-21'
references:
- https://attack.mitre.org/
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
    Image|endswith: \powershell.exe
  selection_cmd:
    CommandLine|contains:
    - -enc
    - JAB
    - SQBFAFgA
  condition: selection_img and selection_cmd
falsepositives:
- Administrative PowerShell automation
- Blue-team triage activity
tags:
- attack.execution
- attack.t1027
level: high
