title: Rundll32 JavaScript Execution
id: 4059c619-9727-4865-a1c2-9043aef9f0c7
description: Detects suspicious rundll32 javascript execution behavior often associated
  with LOLBin abuse.
status: stable
author: Jean Koumou
date: '2026-03-21'
references:
- https://lolbas-project.github.io/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \rundll32.exe
    CommandLine|contains:
    - 'javascript:'
    - mshtml
  condition: selection
falsepositives:
- Rare administrative troubleshooting
tags:
- attack.defense_evasion
- attack.t1218.011
level: high
