title: Remote Service Creation via sc.exe
id: 6a0c1da1-d744-4a9b-979c-50df67dda625
description: Detects remote service creation via sc.exe patterns for lateral movement
  and remote execution.
status: experimental
author: RuleScope Demo
date: '2026-03-21'
references:
- https://attack.mitre.org/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - create
    - \\
    - binPath=
  condition: selection
falsepositives:
- Planned software deployment or administration
tags:
- attack.lateral_movement
- attack.t1543.003
level: medium
