title: VSSAdmin Shadow Copy Delete
id: 5d112b31-7120-4c62-ab8e-5fc191546493
description: Detects vssadmin shadow copy delete often linked to adversary discovery
  or impact activity.
status: stable
author: Jean Koumou
date: '2026-03-21'
modified: '2026-03-21'
references:
- https://attack.mitre.org/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - delete shadows
    - /all
    - /quiet
  condition: selection
falsepositives:
- Rare but legitimate admin maintenance
tags:
- attack.discovery
- attack.t1490
level: high
