title: WMI execution
id: 33333333-3333-3333-3333-333333333333
description: Detects suspicious WMI execution.
status: experimental
level: medium
author: RuleScope Demo
date: 2026-03-21
tags:
  - attack.execution
  - attack.t1047
falsepositives: []
references: []
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains: "wmic"
  condition: selection
