title: Wevtutil Log Clear
id: b4ef5e04-136f-46d6-9f53-39c827fd5596
description: Detects wevtutil log clear often linked to adversary discovery or impact
  activity.
status: stable
author: Jean Koumou
date: '2026-03-21'
modified: '2026-03-21'
references:
- https://attack.mitre.org/
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - wevtutil
    - 'cl '
    - Security
  condition: selection
falsepositives:
- Rare but legitimate admin maintenance
tags:
- attack.discovery
- attack.t1070.001
level: high
